--USE [Library]
USE [2025_PMI_32]
GO

SET IDENTITY_INSERT Книги ON
GO

INSERT INTO Книги (Id, Название, Цена, Год_издания, Число_экземпляров, Id_издательства) VALUES
(2, N'Бескрайний архипелаг', 10000.0000, CAST(N'2025-09-20' AS Date), 10, 1),
(4, N'Город, которого нет', 200.0000, CAST(N'2025-08-10' AS Date), 100, 2),
(7, N'Неучтенный элемент', 200.0000, CAST(N'2025-06-30' AS Date), 20, 3),
(8, N'Миротворец', 200.0000, CAST(N'2024-10-27' AS Date), 100, 4),
(9, N'Странные земли', 400.0000, CAST(N'2024-09-16' AS Date), 33, 5),
(10, N'Звездный поток', 200.0000, CAST(N'2024-08-06' AS Date), 100, 6),
(11, N'Человек государства', 150.0000, CAST(N'2024-06-26' AS Date), 100, 7),
(12, N'Бобер', 200.0000, CAST(N'2025-04-09' AS Date), 40, 8),
(13, N'Егерь', 199.0000, CAST(N'2025-02-27' AS Date), 100, 9),
(14, N'Крысиный бег', 200.0000, CAST(N'2025-05-20' AS Date), 38, 10),
(15, N'Гего звали Тони', 300.0000, CAST(N'2024-05-16' AS Date), 100, 1),
(16, N'Ювелиръ.1807', 200.0000, CAST(N'2025-01-17' AS Date), 60, 2),
(17, N'Танцуя в огне', 200.0000, CAST(N'2024-12-07' AS Date), 400, 3)

GO

SET IDENTITY_INSERT Книги OFF
GO