USE [Library]
GO

DROP TABLE IF EXISTS [dbo].[Читатели]
GO

CREATE TABLE Читатели(
	Id int PRIMARY KEY IDENTITY(1,1) NOT NULL,
	Фамилия nvarchar(50) NOT NULL,
	Имя nvarchar(50) NOT NULL,
	Отчество nvarchar(50),
	Задолженность int,
	Id_группы int NOT NULL FOREIGN KEY REFERENCES Группы(Id)
)
GO

SET IDENTITY_INSERT Читатели ON
GO

INSERT INTO Читатели (Id, Фамилия, Имя, Отчество, Задолженность, Id_группы) VALUES
(1, N'Вихарев', N'Кирилл', NULL, NULL, 1),
(15, N'Кудрявцев', N'Матвей', N'Владимирович', NULL, 1),
(16, N'Кудряшов', N'Никита', N'Романович', NULL, 1),
(17, N'Лопаткин', N'Даниил', N'Евгеньевич', NULL, 1),
(18, N'Мерзун', N'Иван', N'Романович', NULL, 1),
(19, N'Минаева', N'Ксения', N'Аркадьевна', NULL, 1),
(20, N'Немтинов', N'Никита', N'Сергеевич', NULL, 1),
(21, N'Петроченков', N'Михаил', N'Денисович', NULL, 1),
(22, N'Пляскин', N'Дмитрий', N'Ефимович', NULL, 1),
(23, N'Рахимова', N'Регина', N'Ильдаровна', NULL, 1),
(24, N'Рачинский', N'Михаил', N'Сергеевич', NULL, 1),
(25, N'Родин', N'Илья', N'Алексеевич', NULL, 1),
(26, N'Родионов', N'Никита', N'Алексеевич', NULL, 1),
(27, N'Семенов', N'Евгений', N'Николаевич', NULL, 1),
(44, N'Воронцов', N'Илья', N'Александрович', NULL, 3),
(45, N'Демидюк', N'Артем', N'Михайлович', NULL, 3),
(46, N'Державин', N'Владимир', N'Михайлович', NULL, 3),
(47, N'Дмитриев', N'Григорий', N'Сергеевич', NULL, 3),
(48, N'Довгань', N'Мария', N'Дмитриевна', NULL, 3),
(49, N'Жевакин', N'Кирилл', N'Александрович', NULL, 3),
(50, N'Зеленина', N'Юлия', N'Алексеевна', NULL, 3),
(51, N'Капустина', N'Елизавета', N'Юрьевна', NULL, 3),
(52, N'Корнева', N'Татьяна', N'Сергеевна', NULL, 3),
(53, N'Лаврентьева', N'Ксения', N'Дмитриевна', NULL, 3),
(54, N'Локтева', N'Ирина', N'Александровна', NULL, 3),
(55, N'Мартынов', N'Владислав', N'Юрьевич', NULL, 3),
(56, N'Медков', N'Александр', N'Николаевич', NULL, 3),
(57, N'Мешкова', N'Мария', N'Андреевна', NULL, 3),
(58, N'Невзорова', N'Ангелина', N'Романовна', NULL, 3),
(59, N'Никрашевич', N'Егор', N'Витальевич', NULL, 3),
(60, N'Базанова', N'Анастасия', N'Сергеевна', NULL, 2),
(61, N'Величко', N'Глеб', N'Сергеевич', NULL, 2),
(62, N'Голяков', N'Макар', N'Дмитриевич', NULL, 2),
(63, N'Грибанов', N'Никита', N'Романович', NULL, 2),
(64, N'Казакова', N'Анна', N'Игоревна', NULL, 2),
(65, N'Колодочка', N'Денис', N'Евгеньевич', NULL, 2),
(66, N'Кротов', N'Павел', N'Сергеевич', NULL, 2),
(67, N'Круглышев', N'Антон', N'Владимирович', NULL, 2),
(68, N'Лукоянов', N'Кирилл', N'Анатольевич', NULL, 2),
(69, N'Рубанов', N'Никита', N'Денисович', NULL, 2),
(70, N'Сафонов', N'Владислав', N'Дмитриевич', NULL, 2),
(71, N'Седов', N'Константин', N'Евгеньевич', NULL, 2),
(72, N'Сейферман', N'Владислав', N'Борисович', NULL, 2),
(73, N'Скидоненко', N'Ярослав', N'Дмитриевич', NULL, 2)

GO

SET IDENTITY_INSERT Читатели OFF
GO